# print("Привіт!")
# Кортеж (tuple) - це незмінний тип даних, який може містити різні типи даних.
# Кортежі використовуються для зберігання кількох елементів в одному об'єкті. Вони дуже схожі на списки, але на відміну від списків, кортежі не можуть бути змінені після створення.
# Створення кортежу
myTuple = (12, 45, 78)
print("Набір даних у кортежі:")
print(myTuple)  # Виведе: (12, 45, 78)

# Доступ до елементів кортежу
print("Доступ до елементів кортежу:")
print(myTuple[1])  # Виведе: 45 - доступ по індексу (починається з 0)

try:
    myTuple[0] = 18 # Спроба змінити елемент кортежу викличе помилку TypeError, оскільки кортежі є незмінними
except TypeError as e:  # Аналог catch у .NET
    print("Помилка:", e)

print("Кількість елементів у кортежі:", len(myTuple))

for item in myTuple:  # Це цикл foreach як у .NET, який перебирає всі елементи кортежу
    print("Елемент кортежу:", item)

# Перебираю кортеж за допомогою індексів while
i = 0
while i < len(myTuple):
    print(f"myTuple[{i}] = {myTuple[i]}")
    i += 1 # i++ - python не підтримує оператор інкременту, тому використовується i += 1
